Repository: omarbamlhes/Devspring
Catalog: web/modules/custom/devspring/translations/core_*.po
Languages: ar

source: Front Page
ar: الصفحة الرئيسية

source: Description
ar: الوصف

source: Sub-title
ar: العنوان الفرعي

source: Second Title
ar: العنوان الثاني

source: Image
ar: صورة

source: Social Media Links
ar: روابط وسائل التواصل الاجتماعي

source: Facebook
ar: فيسبوك

source: X (Twitter)
ar: X (تويتر)

source: Instagram
ar: إنستغرام

source: LinkedIn
ar: لينكد إن

source: YouTube
ar: يوتيوب

source: Snapchat
ar: سناب شات

source: Translate
ar: ترجمة

source: Translate @type_name
ar: ترجمة @type_name

source: Allowed formats: svg,jpg,jpeg,png
ar: الصيغ المسموح بها: svg، jpg، jpeg، png

source: You must include at least one keyword to match in the content, and punctuation is ignored.
ar: يجب عليك كتابة كلمة رئيسية واحدة على الأقل للبحث في المحتوى، وسيتم تجاهل علامات الترقيم.

source: URL Label
ar: نص URL

source: Section
ar: القسم

source: Features
ar: المزايا

source: Location
ar: الموقع

source: Title
ar: العنوان

source: Contact Us
ar: تواصل معنا

source: Video URL
ar: رابط الفيديو

source: FAQs
ar: الأسئلة الشائعة

source: Order
ar: الترتيب

source: You've reached the maximum number of OTP verification attempts. Please try again later.
ar: لقد استنفذت جميع محاولات التحقق، يرجى المحاولة مرة أخرى في وقت لاحق.

source: Your OTP code is @otp_code
ar: رمز التحقق الخاص بك هو @otp_code

source: The OTP has expired. Please request a new OTP.
ar: انتهت صلاحية رمز التحقق. يرجى طلب رمز تحقق جديد.

source: The OTP record does not exist. Please request a new OTP.
ar: رمز التحقق غير موجود. يرجى طلب رمز تحقق جديد.

source: OTP verified successfully.
ar: تم التحقق من رمز التحقق بنجاح.

source: Invalid OTP. Please try again.
ar: رمز التحقق المدخل غير صحيح. يرجى المحاولة مرة أخرى.

source: The OTP is not expired yet.
ar: لم تنتهي صلاحية رمز التحقق بعد.

source: You have reached the maximum number of attempts to resend the OTP.
ar: لقد وصلت إلى الحد الأقصى لعدد محاولات إعادة إرسال رمز التحقق.

source: The mobile number is required.
ar: رقم الجوال مطلوب.

source: Record with ID @id already exists.
ar: طلب رمز التحقق برقم @id موجود بالفعل.

source: Record with ID @id does not exist.
ar: طلب رمز التحقق برقم @id غير موجود.

source: The mobile number is invalid. Must start with 9665 and contain 9 digits.
ar: رقم الجوال غير صحيح. يجب أن يبدأ بـ 9665 ويحتوي على 9 أرقام.

source: The video link must be in MP4, WebM, or OGG format.
ar: يجب أن يكون رابط الفيديو بتنسيق MP4 أو WebM أو OGG.

source: Please upload an image or video link.
ar: يرجى تحميل صورة أو رابط فيديو.

source: Key Words
ar: الكلمات المفتاحية

source: Search
ar: البحث

source: Show More
ar: عرض المزيد

source: Source string (Built-in English)See the <a href=":available_updates">available updates</a> page for more information and to update your software.
ar: سلسلة المصدر (الإنجليزية المضمنة)راجع صفحة <a href=":available_updates">التحديثات المتوفرة</a> للحصول على مزيد من المعلومات وتحديث البرنامج الخاص بك.

source: Last saved
ar: آخر حفظ

source: Not saved yet
ar: لم يتم الحفظ بعد

source: Briefly describe the changes you have made.
ar: صف بإيجاز التغييرات التي قمت بها.

source: Not promoted
ar: غير مرقى للصفحة الرئيسية

source: Sticky at top of lists
ar: تثبيت في أعلى القوائم

source: Specify an alternative path by which this data can be accessed. For example, type "/about" when writing an about page.
ar: حدد مسارًا بديلًا يمكن من خلاله الوصول إلى هذه البيانات. على سبيل المثال، اكتب "/about" عند كتابة صفحة "حول.

source: The username of the content author.
ar: اسم المستخدم لمؤلف المحتوى.

source: The date and time that the content was created.
ar: تاريخ ووقت إنشاء المحتوى.

source: Promotion options
ar: خيارات الترقية

source: Promoted to front page
ar: مرقّى إلى الصفحة الرئيسية

source: Meta Tags
ar: العلامات التعريفية

source: Configure the meta tags below.
ar: قم بتكوين علامات التعريف أدناه.

source: Use tokens to avoid redundant meta data and search engine penalization. For example, a 'keyword' value of "example" will be shown on all content using this configuration, whereas using the [node:field_keywords] automatically inserts the "keywords" values from the current entity (node, term, etc).
ar: استخدم الرموز لتجنب البيانات الوصفية المكررة وعقوبات محرك البحث. على سبيل المثال، سيتم عرض قيمة "الكلمة الرئيسية" "example" على كل المحتوى باستخدام هذا التكوين، بينما يؤدي استخدام [node:field_keywords] إلى إدراج قيم "الكلمات الرئيسية" تلقائيًا من الكيان الحالي (العقدة، المصطلح، إلخ).

source: Basic tags
ar: العلامات الأساسية

source: Simple meta tags.
ar: العلامات التعريفية البسيطة.

source: The text to display in the title bar of a visitor's web browser when they view this page. This meta tag may also be used as the title of the page when a visitor bookmarks or favorites this page, or as the page title in a search engine result. It is common to append '[site:name]' to the end of this, so the site's name is automatically added. It is recommended that the title is no greater than 55 - 65 characters long, including spaces.
ar: النص الذي سيتم عرضه في شريط العنوان لمتصفح الويب الخاص بالزائر عندما يشاهد هذه الصفحة. يمكن أيضًا استخدام علامة التعريف هذه كعنوان للصفحة عندما يقوم الزائر بإضافة هذه الصفحة إلى الإشارات المرجعية أو المفضلة، أو كعنوان للصفحة في نتيجة محرك البحث. من الشائع إضافة '[site:name]' إلى نهاية هذا، بحيث تتم إضافة اسم الموقع تلقائيًا. يوصى بألا يزيد طول العنوان عن 55 - 65 حرفًا، بما في ذلك المسافات.

source: A brief and concise summary of the page's content that is a maximum of 160 characters in length. The description meta tag may be used by search engines to display a snippet about the page in search results.
ar: ملخص موجز وموجز لمحتوى الصفحة بحد أقصى 160 حرفًا. يمكن لمحركات البحث استخدام علامة الوصف التعريفية لعرض مقتطف عن الصفحة في نتائج البحث.

source: Abstract
ar: ملخص

source: A brief and concise summary of the page's content, preferably 150 characters or less. Where as the description meta tag may be used by search engines to display a snippet about the page in search results, the abstract tag may be used to archive a summary about the page. This meta tag is no longer supported by major search engines.
ar: ملخص موجز وموجز لمحتوى الصفحة، ويفضل ألا يتجاوز 150 حرفًا. وفي حين قد تستخدم محركات البحث علامة الوصف الوصفي لعرض مقتطف عن الصفحة في نتائج البحث، فقد تستخدم علامة الملخص لأرشفة ملخص عن الصفحة. لم تعد محركات البحث الرئيسية تدعم علامة الوصف الوصفي هذه.

source: A comma-separated list of keywords about the page. This meta tag is <em>no longer</em> supported by most search engines.
ar: قائمة منفصلة بفواصل من الكلمات الرئيسية حول الصفحة. لم تعد هذه العلامة الوصفية مدعومة من قبل معظم محركات البحث.

source: Allowed types: @extensions.
ar: الصيغة المتاحة: @extensions.

source: @size limit.
ar: @size الحجم المسموح به.

source: Add content block
ar: إضافة محتوى الصندوق

source: Add media
ar: إضافة الوسائط

source: Media name
ar: اسم الوسيلة الإعلامية

source: No media available.
ar: لا تتوفر أي وسائط.

source: Remote video
ar: فيديو عن بعد

source: Block types
ar: انواع الصندوق

source: Block layout
ar: تخطيط الصندوق

source: Comment types
ar: أنواع التعليقات

source: Display modes
ar: أوضاع العرض

source: Form modes
ar: أوضاع النموذج

source: Add form mode
ar: إضافة وضع النموذج

source: View modes
ar: أوضاع العرض

source: Webforms
ar: النماذج

source: Paragraph types
ar: أنواع الفقرات

source: Add paragraph type
ar: إضافة نوع الفقرة

source: Media types
ar: أنواع الوسائط

source: Basic block
ar: صندوق أساسي

source: Translations for %label
ar: الترجمات لـ %label

source: Add media type
ar: إضافة نوع الوسائط

source: Website feedback
ar: ردود الفعل على الموقع

source: Uninstall module
ar: إلغاء تثبيت الوحدة

source: All types
ar: جميع الانواع

source: Manage webforms
ar: إدارة نماذج الويب

source: Development settings
ar: إعدادات التطوير

source: These settings should only be enabled on development environments and never on production.
ar: ينبغي تمكين هذه الإعدادات فقط في بيئات التطوير وليس في بيئات الإنتاج أبدًا.

source: Do not cache markup
ar: لا تقم بتخزين العلامات مؤقتًا

source: Disables render cache, dynamic page cache, and page cache.
ar: يقوم بتعطيل ذاكرة التخزين المؤقت للعرض وذاكرة التخزين المؤقت للصفحة الديناميكية وذاكرة التخزين المؤقت للصفحة.

source: Twig development mode
ar: وضع تطوير Twig

source: Exposes Twig development settings.
ar: يعرض إعدادات تطوير Twig.

source: Region and language
ar: المنطقة واللغة

source: Date and time formats
ar: تنسيقات التاريخ والوقت

source: Content language and translation
ar: لغة المحتوى والترجمة

source: Change language settings for <em>content types</em>, <em>taxonomy vocabularies</em>, <em>user profiles</em>, or any other supported element on your site. By default, language settings hide the language selector and the language is the site's default language.
ar: قم بتغيير إعدادات اللغة لأنواع المحتوى، ومفردات التصنيف، وملفات تعريف المستخدم، أو أي عنصر آخر مدعوم على موقعك. بشكل افتراضي، تخفي إعدادات اللغة محدد اللغة وتكون اللغة هي اللغة الافتراضية للموقع.

source: Custom menu link
ar: رابط القائمة المخصصة

source: Custom language settings
ar: إعدادات اللغة المخصصة

source: Paragraph
ar: الفقرة

source: @label (Translation is not supported).
ar: @label (الترجمة غير مدعومة).

source: Start typing the title of a piece of content to select it. You can also enter an internal path such as %add-node or an external URL such as %url. Enter %front to link to the front page. Enter %nolink to display link text only. Enter %button to display keyboard-accessible link text only.
ar: ابدأ بكتابة عنوان قطعة من المحتوى لتحديدها. يمكنك أيضًا إدخال مسار داخلي مثل %add-node أو عنوان URL خارجي مثل %url. أدخل %front للارتباط بالصفحة الرئيسية. أدخل %nolink لعرض نص الرابط فقط. أدخل %button لعرض نص الرابط الذي يمكن الوصول إليه باستخدام لوحة المفاتيح فقط.

source: Menu description
ar: وصف القائمة

source: Manage view modes
ar: إدارة أوضاع العرض

source: You can enable the newly-created block for this menu on the <a href=":blocks">Block layout page</a>.
ar: يمكنك تفعيل الصناديق الجديدة لهذه القائمة في <a href=":blocks">صفحة تخطيط الصناديق</a>.

source: Menu language
ar: لغة القائمة

source: A flag for whether the link should be enabled in menus or hidden.
ar: علم لتحديد ما إذا كان يجب تمكين الرابط في القوائم أم إخفاؤه.

source: If selected and this menu link has children, the menu will always appear expanded. This option may be overridden for the entire menu tree when placing a menu block.
ar: إذا تم التحديد وكان لرابط القائمة عناصر فرعية، ستظهر القائمة موسعة دائماً. يمكن تجاوز هذا الخيار لشجرة القائمة بأكملها عند وضع كتلة القائمة.

source: Administrative summary
ar: ملخص إداري

source: Clear related data
ar: مسح البيانات ذات الصلة

source: Name or email contains
ar: الاسم أو البريد الإلكتروني يحتوي على

source: Apply to selected items
ar: تطبيق على العناصر المحددة

source: 1 item selected
ar: تم تحديد عنصر واحد

source: The email address is not made public. It will only be used if you need to be contacted about your account or for opted-in notifications.
ar: لن يتم نشر عنوان البريد الإلكتروني. سيتم استخدامه فقط إذا كنت بحاجة إلى الاتصال بشأن حسابك أو للإشعارات التي تم الاشتراك فيها.

source: Several special characters are allowed, including space, period (.), hyphen (-), apostrophe ('), underscore (_), and the @ sign.
ar: يُسمح بعدد من الرموز الخاصة، بما في ذلك المسافة، النقطة (.)، الشرطة (-)، الفاصلة (')، الشرطة السفلية (_)، وعلامة @.

source: Your virtual face or picture.
ar: وجهك الافتراضي أو صورتك.

source: This account's preferred language for emails.
ar: اللغة المفضلة لهذا الحساب للرسائل الإلكترونية.

source: This is also assumed to be the primary language of this account's profile information.
ar: يُفترض أيضًا أنها اللغة الأساسية لمعلومات ملف تعريف هذا الحساب.

source: This web page allows administrators to register new users. Users' email addresses and usernames must be unique.
ar: تسمح هذه الصفحة بالمسؤولين بتسجيل مستخدمين جدد. يجب أن تكون عناوين البريد الإلكتروني وأسماء المستخدمين للمستخدمين فريدة.

source: Role settings
ar: إعدادات الدور

source: No terms available. <a href=":link">Add term</a>.
ar: لا توجد مصطلحات متاحة. <a href=":link">أضف مصطلح</a>.

source: No items selected
ar: لا يتم تحديد أي عناصر

source: Moderated content
ar: إدارة المحتوى

source: Moderate content
ar: إدارة المحتوى

source: Change to
ar: تغيير إلى

source: Revisions allow you to track differences between multiple versions of your content, and revert to older versions.
ar: تتيح لك المراجعات تتبع الاختلافات بين الإصدارات المتعددة للمحتوى الخاص بك، والعودة إلى الإصدارات الأقدم.

source: @date by @username
ar: @date بواسطة @username

source: Current revision
ar: المراجعة الحالية

source: <strong>@language_name (Original language)</strong>
ar: <strong>@language_name (اللغة الأصلية)</strong>

source: There are no content blocks available.
ar: لا توجد أي كتلة محتوى متاحة.

source: Add a <a href=":url">content block</a>.
ar: أضف <a href=":url">كتلة محتوى</a>.

source: Add child
ar: أضف الفرعي

source: Translations of %label
ar: ترجمات %label

source: Save and go to list
ar: حفظ والذهاب إلى القائمة

source: <em>Current revision</em>
ar: <em>المراجعة الحالية</em>

source: @revision by @username
ar: @revision بواسطة @username

source: Content blocks
ar: كتلة محتوى

source: Add-ons
ar: إضافات

source: Webforms: Add-ons
ar: الاستمارات الويب: إضافات

source: Interface text language selected for page
ar: اللغة التوضيحية المحددة للصفحة

source: Back to site
ar: العودة إلى الموقع

source: Reset your password
ar: إعادة تعيين كلمة المرور الخاصة بك

source: %capital_name contains the following terms.
ar: %capital_name يحتوي على المصطلحات التالية.

source: Delete all translations
ar: حذف جميع الترجمات

source: Password reset instructions will be sent to your registered email address.
ar: سيتم إرسال تعليمات إعادة تعيين كلمة المرور إلى عنوان البريد الإلكتروني المسجل الخاص بك.

source: Forgot your password?
ar: هل نسيت كلمة المرور؟

source: Unrecognized username or password. <a href=":password">Forgot your password?</a>
ar: اسم المستخدم أو كلمة المرور غير معروفة. <a href=":password">هل نسيت كلمة المرور؟</a>

source: Add the @label role to the selected user(s)
ar: أضف دور @label إلى المستخدمين المحددين

source: Remove the @label role from the selected user(s)
ar: قم بإزالة دور @label من المستخدمين المحددين

source: Unblock the selected user(s)
ar: إلغاء حظر المستخدمين المحددين

source: Block the selected user(s)
ar: حظر المستخدمين المحددين

source: Cancel the selected user account(s)
ar: إلغاء حساب المستخدمين المحددين

source: @count second
ar: ثانية

source: @count minute
ar: دقيقة

source: @count week
ar: أسبوع واحد

source: @count month
ar: شهر واحد

source: @count year
ar: سنة واحدة

source: Metatag
ar: العلامة التعريفية

source: Metatag defaults
ar: القيم الافتراضية للعلامة التعريفية

source: Add default meta tags
ar: إضافة علامة تعريفية افتراضية

source: Add meta tag for custom route
ar: إضافة علامة تعريفية لمسار مخصص

source: canonical_url
ar: عنوان URL الرسمي

source: Separator used with multiple values
ar: الفاصل المستخدم مع القيم المتعددة

source: Controls the separator used when a meta tag allows multiple values. Multiple characters can be used together, it does not have to be one single character long. Defaults to ":default".
ar: يتحكم في الفاصل المستخدم عندما يسمح وسم العلامة التعريفية بقيم متعددة. يمكن استخدام عدة أحرف معًا، ولا يشترط أن يكون الفاصل حرفًا واحدًا فقط. الافتراضي هو ":default".

source: Entity type / Group Mapping
ar: نوع الكيان / تعيين المجموعة.

source: Many Meta-Tags can be trimmed on a specific length for search engine optimization.<br/>If the value is set to '0' or left empty, the whole Metatag will be untrimmed.
ar: يمكن تقليص العديد من العلامات الوصفية (ميتاتاج) إلى طول محدد من أجل تحسين محركات البحث.<br/>إذا تم تعيين القيمة إلى '0' أو تركها فارغة، سيتم إبقاء العلامة الوصفية كما هي دون تقليص.

source: Use Maxlength module to force these limits?
ar: استخدام وحدة الحد الاقصى للطول لفرض هذه الحدود؟

source: Install the Maxlength module to enable this option.
ar: قم بتثبيت وحدة الحد الاقصى للطول لتمكين هذه الخيار

source: Metatag Trimming Options
ar: خيارات تقليم العلامات التعريفية

source: Configure the Metatag module
ar: تكوين وحدة العلامات التعريفية

source: Identify which metatag groups should be available on which entity type / bundle combination. Unselected groups will not appear on the configuration form for that entity type, reducing the size of the form and increasing performance. If no groups are selected for a type, all groups will appear.
ar: حدد مجموعات العلامة التعريفية التي يجب ان تكون متاحة لاي نوع كيان/مجموعة من التركيبات.المجموعات غير المحددة لن تظهر في نموذج التكوين لذلك النوع من الكيانات، مما يقلل من حجم النموذج ويزيد من الاداء.إذا لم يتم تحديد أي مجموعات لنوع معين،ستظهر جميع المجموعات.

source: Trimming options
ar: خيارات التقليم.

source: Characters to trim
ar: الأحرف التي سيتم تقليصها

source: A list of characters to trim at the end of all metatags. Provide a single string without any separators, e.g. "|,." (instead of "| , ."). Note that spaces, tabs, new lines, carriage returns and vertical tabs (" v") will be trimmed automatically and do not need to be listed in this field. The trimming is applied at the very end after the tag is trimmed for length, and after the trimming option was executed.
ar: قائمة بالأحرف التي سيتم تقليصها في نهاية جميع العلامات التعريفية (ميتاتاج). قدم سلسلة مفردة بدون أي فواصل، مثل "|,." (بدلاً من "| , ."). ملاحظة: المسافات، والفواصل، والأسطر الجديدة، وعلامات الرجوع، وعلامات التبويب الرأسية (" v") سيتم تقليصها تلقائيًا ولا حاجة لإدراجها في هذا الحقل. يتم تطبيق عملية التقليم في النهاية بعد تقليص العلامة التعريفية للطول، وبعد تنفيذ خيار التقليم.

source: Metatag widget options
ar: خيارات أداة العلامة التعريفية

source: Various options for the field widget used on entity forms, e.g. on content type forms.
ar: خيارات متنوعة لأداة الحقل المستخدمة في نماذج الكيانات، مثل نماذج أنواع المحتوى.

source: Scroll maximum height
ar: الحد الأقصى لارتفاع التمرير.

source: To enable scrolling please enter a value and its units, e.g. 500px, 8rem, etc. Removing this value will remove the scroll.
ar: لتمكين التمرير، يرجى إدخال قيمة ووحداتها، مثل 500px، 8rem، إلخ. إزالة هذه القيمة سيؤدي إلى إزالة التمرير.

source: To use tokens to image fields, the image field on that entity bundle (content type, term, etc) must have the "Token" display settings enabled, the image field must not be hidden, and it must be set to output as an image, e.g. using the "Thumbnail" field formatter. It is also recommended to use an appropriate image style that resizes the image rather than output the original image; see individual meta tag descriptions for size recommendations.
ar: لاستخدام الرموز مع حقول الصور، يجب تمكين إعدادات العرض "Token" لحقل الصورة في تلك الحزمة الكيانية (نوع المحتوى، المصطلح، إلخ)، ويجب ألا يكون حقل الصورة مخفيًا، ويجب تعيينه للإخراج كصورة، مثلًا باستخدام مُنسق الحقل "Thumbnail". يُوصى أيضًا باستخدام نمط صورة مناسب يقوم بتغيير حجم الصورة بدلاً من إخراج الصورة الأصلية؛ راجع أوصاف العلامات الوصفية الفردية للحصول على توصيات الحجم.

source: Select the type of default meta tags you would like to add.
ar: اختر نوع العلامات الوصفية الافتراضية التي ترغب في إضافتها.

source: Meta tags that might not be needed by many sites.
ar: العلامات التعريفية قد لاتكون بحاجة إليها العديد من المواقع

source: Geographical position
ar: الموقع الجغرافي

source: Geo-spatial information in 'latitude; longitude' format, e.g. '50.167958; -97.133185'; <a href='https://en.wikipedia.org/wiki/Geographic_coordinate_system' aria-label='see Wikipedia for details on the geographic coordinate system'>see Wikipedia for details</a>.
ar: معلومات جغرافية بتنسيق 'خط العرض; خط الطول'، مثل '50.167958; -97.133185'; <a href='https://en.wikipedia.org/wiki/Geographic_coordinate_system' aria-label='انظر ويكيبيديا للتفاصيل حول نظام الإحداثيات الجغرافية'>انظر ويكيبيديا للتفاصيل</a>.

source: Geo-spatial information in 'latitude, longitude' format, e.g. '50.167958, -97.133185'; <a href='https://en.wikipedia.org/wiki/ICBM_address' aria-label='see Wikipedia for details on ICBM addresses'>see Wikipedia for details</a>.
ar: معلومات جغرافية بتنسيق 'خط العرض، خط الطول'، مثل '50.167958، -97.133185'; <a href='https://en.wikipedia.org/wiki/ICBM_address' aria-label='انظر ويكيبيديا للتفاصيل حول عناوين ICBM'>راجع ويكيبيديا للتفاصيل</a>.

source: Geographical place name
ar: اسم المكان الجغرافي

source: A location's formal name.
ar: الاسم الرسمي للموقع.

source: Geographical region
ar: المنطقة الجغرافية

source: A location's two-letter international country code, with an optional two-letter region, e.g. 'US-NH' for New Hampshire in the USA.
ar: رمز الدولة الدولي المكون من حرفين لموقع معين، مع إمكانية إضافة رمز إقليمي مكون من حرفين، مثل 'US-NH' لولاية نيوهامبشاير في الولايات المتحدة الأمريكية.

source: Shortlink URL
ar: رابط قصير

source: A brief URL, often created by a URL shortening service.
ar: رابط مختصر، غالبًا ما يتم إنشاؤه بواسطة خدمة تقصير الروابط.

source: Robots
ar: روبوتات

source: index - Allow search engines to index this page (assumed).
ar: فهرسة - السماح لمحركات البحث بفهرسة هذه الصفحة (مفترض).

source: follow - Allow search engines to follow links on this page (assumed).
ar: اتبع - السماح لمحركات البحث بمتابعة الروابط على هذه الصفحة (مفترض).

source: noindex - Prevents search engines from indexing this page.
ar: noindex - يمنع محركات البحث من فهرسة هذه الصفحة.

source: nofollow - Prevents search engines from following links on this page.
ar: nofollow - يمنع محركات البحث من متابعة الروابط على هذه الصفحة.

source: noarchive - Prevents cached copies of this page from appearing in search results.
ar: noarchive - يمنع ظهور النسخ المخزنة من هذه الصفحة في نتائج البحث.

source: nosnippet - Prevents descriptions from appearing in search results, and prevents page caching.
ar: nosnippet - يمنع ظهور الوصف في نتائج البحث، ويمنع تخزين الصفحة في الذاكرة المؤقتة.

source: noimageindex - Prevent search engines from indexing images on this page.
ar: noimageindex - يمنع محركات البحث من فهرسة الصور على هذه الصفحة.

source: notranslate - Prevent search engines from offering to translate this page in search results.
ar: notranslate - يمنع محركات البحث من عرض خيار ترجمة هذه الصفحة في نتائج البحث.

source: Provides search engines with specific directions for what to do when this page is indexed.
ar: يوفر لمحركات البحث تعليمات محددة حول ما يجب فعله عند فهرسة هذه الصفحة.

source: Max Snippet
ar: استخدم رقمًا كـ مقتطف نصي لهذه النتيجة في البحث. "0" يعني "nosnippet". "-1" سيتيح لمحرك البحث تحديد الطول الأكثر فعالية.

source: Use a number character as a textual snippet for this search result. "0" equals "nosnippet". "-1" will let the search engine decide the most effective length.
ar: استخدم رقمًا كـ مقتطف نصي لهذه النتيجة في البحث. "0" يعادل "nosnippet". "-1" سيسمح لمحرك البحث بتحديد الطول الأكثر فعالية.

source: Max Video Preview
ar: أقصى معاينة للفيديو

source: Use a maximum of number seconds as a video snippet for videos on this page in search results. "0" will use a static a image. "-1" means there is no limit.
ar: استخدم أقصى عدد من الثواني كمقتطف فيديو للفيديوهات في هذه الصفحة في نتائج البحث. "0" سيستخدم صورة ثابتة. "-1" يعني أنه لا يوجد حد.

source: Max Image Preview
ar: أقصى معاينة للصورة

source: Set the maximum size of an image preview for this page in a search results.
ar: حدد الحد الأقصى لحجم معاينة الصورة لهذه الصفحة في نتائج البحث.

source: Unavailable after date
ar: غير متاح بعد تاريخ

source: Do not show this page in search results after the specified date
ar: لا تعرض هذه الصفحة في نتائج البحث بعد التاريخ المحدد.

source: A link to the preferred page location or URL of the content of this page, to help eliminate duplicate content penalties from search engines.
ar: رابط إلى الموقع المفضل أو عنوان URL لمحتوى هذه الصفحة، للمساعدة في القضاء على عقوبات المحتوى المكرر من محركات البحث.

source: Next page URL
ar: رابط الصفحة التالية
