Repository: omarbamlhes/Devspring
Catalog: web/modules/custom/devspring/translations/core_*.po
Languages: ar

source: Value that the context is going to have when no config page is found for the current context
ar: القيمة التي سيحصل عليها السياق عندما لا يتم العثور على صفحة تكوين للسياق الحالي

source: Expose this ConfigPage values as tokens.
ar: عرض قيم إعدادات الصفحات هذه كرموز

source: <em>Edit config page</em> @label
ar: <em>تعديل صفحة التكوين</em> @label

source: Devel
ar: تطوير

source: Add config page
ar: إضافة إعدادات الصفحات

source: Manage Config pages
ar: إدارة إعدادات الصفحات

source: Add Config page
ar: إضافة إعدادات الصفحات

source: Beta version
ar: نسخة تجريبية
