Repository: omarbamlhes/Devspring
Catalog: web/modules/custom/devspring/translations/core_*.po
Languages: ar

source: Used for paginated content by providing URL with rel='next' link.
ar: يستخدم للمحتوى المقسم إلى صفحات عن طريق توفير رابط URL مع خاصية rel='next'.

source: Previous page URL
ar: رابط الصفحة السابقة

source: Used for paginated content by providing URL with rel='prev' link.
ar: يستخدم للمحتوى المقسم إلى صفحات عن طريق توفير رابط URL مع خاصية rel='prev'.

source: Original source
ar: المصدر الأصلي

source: Used to indicate the URL that broke the story, and can link to either an internal URL or an external source. If the full URL is not known it is acceptable to use a partial URL or just the domain name.
ar: يستخدم للإشارة إلى الرابط الذي نشر القصة لأول مرة، ويمكن أن يرتبط إما بعنوان URL داخلي أو مصدر خارجي. إذا لم يكن الرابط الكامل معروفًا، يمكن استخدام رابط جزئي أو مجرد اسم النطاق.

source: An image associated with this page, for use as a thumbnail in social networks and other services. This will be able to extract the URL from an image field if the field is configured properly.
ar: صورة مرتبطة بهذه الصفحة، لاستخدامها كصورة مصغرة في الشبكات الاجتماعية والخدمات الأخرى. سيكون بالإمكان استخراج الرابط من حقل الصورة إذا تم تكوين الحقل بشكل صحيح.

source: Generator
ar: المنشئ

source: Describes the name and version number of the software or publishing tool used to create the page.
ar: يصف اسم ورقم الإصدار للبرمجيات أو أداة النشر المستخدمة لإنشاء الصفحة.

source: Define the author of a page.
ar: تعريف مؤلف الصفحة.

source: Referrer policy
ar: سياسة المحيل

source: Indicate to search engines and other page scrapers whether or not links should be followed. See <a href='https://w3c.github.io/webappsec/specs/referrer-policy/'>the W3C specifications</a> for further details. Note: this serves the same purpose as the HTTP header by the same name.
ar: يشير إلى محركات البحث وأدوات جمع البيانات الأخرى ما إذا كان يجب متابعة الروابط أم لا. راجع مواصفات W3C لمزيد من التفاصيل. ملاحظة: هذا يؤدي نفس الغرض من رأس HTTP بنفس الاسم.

source: Set cookie
ar: تعيين ملف تعريف الارتباط

source: <a href='https://www.metatags.org/meta_http_equiv_set_cookie'>Sets a cookie</a> on the visitor's browser. Can be in either NAME=VALUE format, or a more verbose format including the path and expiration date; see the link for full details on the syntax.
ar: <a href='https://www.metatags.org/meta_http_equiv_set_cookie'>يتم تعيين ملف تعريف الارتباط</a> على متصفح الزائر. يمكن أن يكون بتنسيق NAME=VALUE، أو بتنسيق أكثر تفصيلاً يتضمن المسار وتاريخ الانتهاء؛ راجع الرابط للحصول على التفاصيل الكاملة حول الصيغة.

source: Rights
ar: الحقوق

source: Details about intellectual property, such as copyright or trademarks; does not automatically protect the site's content or intellectual property.
ar: تفاصيل عن الملكية الفكرية، مثل حقوق الطبع والنشر أو العلامات التجارية؛ لا تحمي محتوى الموقع أو الملكية الفكرية بشكل تلقائي.

source: Source string (Built-in English)This meta tag communicates with Google. There are currently two directives supported: 'nositelinkssearchbox' to not to show the sitelinks search box, and 'notranslate' to ask Google not to offer a translation of the page. Both options may be added, just separate them with a comma. See <a href='https://support.google.com/webmasters/answer/79812?hl=en'>meta tags that Google understands</a> for further details
ar: يتم التواصل مع جوجل من خلال هذا الوسم الميتا. هناك توجيهان مدعومان حالياً: 'nositelinkssearchbox' لعدم عرض مربع بحث الروابط داخل الموقع، و 'notranslate' لطلب من جوجل عدم عرض ترجمة للصفحة. يمكن إضافة الخيارين معاً، فقط افصل بينهما بفاصلة. راجع الوسوم الميتا التي يفهمها جوجل لمزيد من التفاصيل.

source: Rating
ar: التقييم

source: Used to rate content for audience appropriateness. This tag has little known influence on search engine rankings, but can be used by browsers, browser extensions, and apps. The <a href='https://www.metatags.org/meta_name_rating'>most common options</a> are general, mature, restricted, 14 years, safe for kids. If you follow the <a href='https://www.rtalabel.org/index.php?content=howto'>RTA Documentation</a> you should enter RTA-5042-1996-1400-1577-RTA
ar: يتم استخدامه لتقييم المحتوى من حيث ملاءمته للجمهور. لهذا الوسم تأثير ضئيل معروف على ترتيب محركات البحث، لكنه يمكن أن يُستخدم من قبل المتصفحات، امتدادات المتصفح، والتطبيقات. أكثر الخيارات شيوعاً هي عام، ناضج، مقيد، 14 سنة، آمن للأطفال. إذا كنت تتبع توثيق RTA يجب أن تدخل RTA-5042-1996-1400-1577-RTA.

source: The number of seconds to wait before refreshing the page. May also force redirect to another page using the format '5; url=https://example.com/', which would be triggered after five seconds.
ar: عدد الثواني التي يجب الانتظار قبل تحديث الصفحة. يمكن أيضاً أن يتم إعادة التوجيه إلى صفحة أخرى باستخدام التنسيق '5; url=https://example.com/'، والذي سيتم تفعيله بعد خمس ثوان.

source: Revisit After
ar: إعادة الزيارة بعد

source: Tell search engines when to index the page again. Very few search engines support this tag, it is more useful to use an <a href='https://www.drupal.org/project/xmlsitemap'>XML Sitemap</a> file.
ar: أخبر محركات البحث بموعد إعادة فهرسة الصفحة. قلة قليلة من محركات البحث تدعم هذا الوسم، ومن الأكثر فائدة استخدام ملف خريطة الموقع XML.

source: Cache control
ar: تحكم في التخزين المؤقت

source: Used to control whether a browser caches a specific page locally. Not commonly used. Should be used in conjunction with the Pragma meta tag.
ar: يُستخدم للتحكم فيما إذا كان المتصفح يقوم بتخزين صفحة معينة محلياً. لا يُستخدم عادةً. يجب استخدامه جنباً إلى جنب مع وسم الميتا Pragma.

source: Expires
ar: انتهاء الصلاحية

source: Control when the browser's internal cache of the current page should expire. The date must to be an <a href='https://www.csgnetwork.com/timerfc1123calc.html'>RFC-1123</a>-compliant date string that is represented in Greenwich Mean Time (GMT), e.g. 'Thu, 01 Sep 2016 00:12:56 GMT'. Set to '0' to stop the page being cached entirely.
ar: التحكم في موعد انتهاء صلاحية التخزين المؤقت الداخلي للمتصفح للصفحة الحالية. يجب أن يكون التاريخ عبارة عن سلسلة تاريخ متوافقة مع RFC-1123 تم تمثيلها بتوقيت غرينيتش (GMT)، مثل 'Thu, 01 Sep 2016 00:12:56 GMT'. قم بتعيينه إلى '0' لوقف تخزين الصفحة مؤقتًا تمامًا.

source: Used to control whether a browser caches a specific page locally. Not commonly used. Should be used in conjunction with the Cache-Control meta tag.
ar: يُستخدم للتحكم فيما إذا كان المتصفح يقوم بتخزين صفحة معينة محلياً. لا يُستخدم بشكل شائع. يجب استخدامه جنباً إلى جنب مع وسم الميتا Cache-Control.

source: Favicons & touch icons
ar: أيقونات المفضلة وأيقونات اللمس

source: Meta tags for displaying favicons of various sizes and types. All values should be either absolute or relative URLs. No effects are added to the "precomposed" icons.
ar: "علامات الميتا لعرض الأيقونات المفضلة بأحجام وأنواع مختلفة. يجب أن تكون جميع القيم إما روابط مطلقة أو نسبية. لا يتم إضافة أي تأثيرات على الأيقونات "المركبة مسبقًا".

source: Default icon
ar: الأيقونة الافتراضية

source: The traditional favicon, must be either a GIF, ICO, JPG/JPEG or PNG image.
ar: الأيقونة المفضلة التقليدية يجب أن تكون إما صورة بصيغة GIF أو ICO أو JPG/JPEG أو PNG.

source: A grayscale scalable vector graphic (SVG) file.
ar: ملف رسومي متجه قابل للتطوير بتدرج رمادي (SVG).

source: Mask icon color
ar: لون أيقونة القناع

source: Color attribute for SVG (mask) icon in hexadecimal format, e.g. '#0000ff'. Setting it will break HTML validation. If not set macOS Safari ignores the Mask Icon entirely, making the Icon: SVG completely useless.
ar: "خاصية اللون لأيقونة SVG (القناع) بصيغة تنسيق اللون الست عشري، مثل '#0000ff'. تعيينها سيؤدي إلى كسر التحقق من صحة HTML. إذا لم يتم تعيينها، فإن متصفح Safari على macOS سيتجاهل أيقونة القناع تمامًا، مما يجعل أيقونة SVG غير صالحة تمامًا.

source: Icon: 16px x 16px
ar: الأيقونة: 16 بكسل × 16 بكسل

source: Icon: 32px x 32px
ar: الأيقونة: 32 بكسل × 32 بكسل

source: Icon: 96px x 96px
ar: الأيقونة: 96 بكسل × 96 بكسل

source: Icon: 192px x 192px
ar: الأيقونة: 192 بكسل × 192 بكسل

source: A PNG image that is 16px wide by 16px high.
ar: صورة PNG بعرض 16 بكسل وارتفاع 16 بكسل.

source: A PNG image that is 32px wide by 32px high.
ar: صورة PNG بعرض 32 بكسل وارتفاع 32 بكسل.

source: This will be able to extract the URL from an image field if the field is configured properly.
ar: سيكون بإمكانه استخراج الرابط من حقل الصورة إذا تم تكوين الحقل بشكل صحيح.

source: A PNG image that is 96px wide by 96px high.
ar: صورة PNG بعرض 96 بكسل وارتفاع 96 بكسل.

source: Apple touch icon: 60px x 60px
ar: أيقونة لمسية لأجهزة آبل: 60 بكسل × 60 بكسل

source: Apple touch icon: 72px x 72px
ar: أيقونة لمسية لأجهزة آبل: 72 بكسل × 72 بكسل

source: A PNG image that is 60px wide by 60px high. Used with the non-Retina iPhone, iPod Touch, and Android 2.1+ devices.
ar: صورة PNG بعرض 60 بكسل وارتفاع 60 بكسل. تُستخدم مع أجهزة آيفون غير Retina، وآيبود تاتش، وأجهزة أندرويد 2.1 وما فوق.

source: A PNG image that is 72px wide by 72px high. Used with the iPad mini and the first- and second-generation iPad (@1x display) on iOS <= 6.
ar: صورة PNG بعرض 72 بكسل وارتفاع 72 بكسل. تُستخدم مع جهاز iPad mini وأجهزة iPad الجيل الأول والثاني (عرض @1x) على iOS <= 6.

source: Apple touch icon: 76px x 76px
ar: أيقونة لمسية لأجهزة آبل: 76 بكسل × 76 بكسل

source: A PNG image that is 76px wide by 76px high. Used with the iPad mini and the second-generation iPad (@1x display) on iOS >= 7.
ar: صورة PNG بعرض 76 بكسل وارتفاع 76 بكسل. تُستخدم مع جهاز iPad mini وجهاز iPad الجيل الثاني (عرض @1x) على iOS >= 7.

source: Apple touch icon: 114px x 114px
ar: أيقونة لمسية لأجهزة آبل: 114 بكسل × 114 بكسل

source: A PNG image that is 114px wide by 114px high. Used with iPhone with @2x display running iOS <= 6.
ar: صورة PNG بعرض 114 بكسل وارتفاع 114 بكسل. تُستخدم مع آيفون مزود بشاشة @2x يعمل بنظام iOS <= 6.

source: Apple touch icon: 120px x 120px
ar: أيقونة لمسية لأجهزة آبل: 120 بكسل × 120 بكسل

source: A PNG image that is 120px wide by 120px high. Used with iPhone with @2x display running iOS >= 7.
ar: صورة PNG بعرض 120 بكسل وارتفاع 120 بكسل. تُستخدم مع آيفون مزود بشاشة @2x يعمل بنظام iOS >= 7.

source: Apple touch icon: 144px x 144px
ar: أيقونة لمسية لأجهزة آبل: 144 بكسل × 144 بكسل

source: A PNG image that is 144px wide by 144px high. Used with iPad with @2x display running iOS <= 6.
ar: صورة PNG بعرض 144 بكسل وارتفاع 144 بكسل. تُستخدم مع جهاز iPad مزود بشاشة @2x يعمل بنظام iOS <= 6.

source: Apple touch icon: 152px x 152px
ar: أيقونة لمسية لأجهزة آبل: 152 بكسل × 152 بكسل

source: Apple touch icon: 180px x 180px
ar: أيقونة لمسية لأجهزة آبل: 180 بكسل × 180 بكسل

source: Apple touch icon (precomposed): 57px x 57px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 57 بكسل × 57 بكسل

source: Apple touch icon (precomposed): 72px x 72px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 72 بكسل × 72 بكسل

source: Apple touch icon (precomposed): 76px x 76px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 76 بكسل × 76 بكسل

source: Apple touch icon (precomposed): 114px x 114px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 114 بكسل × 114 بكسل

source: Apple touch icon (precomposed): 120px x 120px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 120 بكسل × 120 بكسل

source: Apple touch icon (precomposed): 144px x 144px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 144 بكسل × 144 بكسل

source: Apple touch icon (precomposed): 152px x 152px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 152 بكسل × 152 بكسل

source: Apple touch icon (precomposed): 180px x 180px
ar: أيقونة لمسية لأجهزة آبل (مركبة مسبقًا): 180 بكسل × 180 بكسل

source: A PNG image that is 152px wide by 152px high. Used with iPad with @2x display running iOS >= 7.
ar: صورة PNG بعرض 152 بكسل وارتفاع 152 بكسل. تُستخدم مع جهاز iPad مزود بشاشة @2x يعمل بنظام iOS >= 7.

source: A PNG image that is 180px wide by 180px high. Used with iPhone 6 Plus with @3x display
ar: صورة PNG بعرض 180 بكسل وارتفاع 180 بكسل. تُستخدم مع آيفون 6 بلس مزود بشاشة @3x.

source: facebook
ar: فيس بوك

source: A set of meta tags specially for controlling advanced functionality with Facebook.
ar: مجموعة من علامات الميتا خصيصًا للتحكم في الوظائف المتقدمة مع فيسبوك.

source: A set of meta tags specially for controlling advanced functionality with <a href=':fb'>Facebook</a>.<br><br>The Facebook <a href='https://developers.facebook.com/tools/debug/'>Sharing Debugger</a> lets you preview how your content will look when it's shared to Facebook and debug any issues with your Open Graph tags.
ar: مجموعة من علامات الميتا خصيصًا للتحكم في الوظائف المتقدمة مع <a href=':fb'>فيسبوك</a>.<br><br>أداة <a href='https://developers.facebook.com/tools/debug/'>Sharing Debugger</a> من فيسبوك تتيح لك معاينة كيفية ظهور المحتوى الخاص بك عند مشاركته على فيسبوك وتصحيح أي مشاكل في علامات Open Graph الخاصة بك.

source: Facebook Pages
ar: صفحات فيسبوك

source: Facebook Instant Articles claim URL token.
ar: رمز URL للمطالبة بمقالات فيسبوك الفورية.

source: Facebook Admins
ar: مديرو فيسبوك

source: A comma-separated list of Facebook user IDs of people who are considered administrators or moderators of this page.
ar: قائمة مفصولة بفواصل لمعرفات المستخدمين على فيسبوك للأشخاص الذين يُعتبرون مديري أو مشرفي هذه الصفحة.

source: Facebook Application ID
ar: معرف تطبيق فيسبوك

source: A comma-separated list of Facebook Platform Application IDs applicable for this site.
ar: قائمة مفصولة بفواصل لمعرفة تطبيقات منصة فيسبوك المطبقة لهذا الموقع.

source: Twitter Cards
ar: بطاقات تويتر

source: A set of meta tags specially for controlling the summaries displayed when content is shared on <a href='https://twitter.com/'>Twitter</a>.
ar: مجموعة من علامات الميتا خصيصًا للتحكم في الملخصات المعروضة عند مشاركة المحتوى على <a href='https://twitter.com/'>تويتر</a>.

source: Twitter card type
ar: نوع بطاقة تويتر

source: Notes:<ul><li>no other fields are required for a Summary card</li><li>Media player card requires the 'title', 'description', 'media player URL', 'media player width', 'media player height' and 'image' fields,</li><li>Summary Card with Large Image card requires the 'Summary' field and the 'image' field,</li><li>App Card requires the 'iPhone app ID' field, the 'iPad app ID' field and the 'Google Play app ID' field,</li></ul>
ar: ملاحظات:<ul><li>لا توجد حقول أخرى مطلوبة لبطاقة الملخص</li><li>تتطلب بطاقة مشغل الوسائط حقول "العنوان" و"الوصف" و"عنوان URL لمشغل الوسائط" و"عرض مشغل الوسائط" و"ارتفاع مشغل الوسائط" و"الصورة"،</li><li>تتطلب بطاقة الملخص ذات البطاقة ذات الصورة الكبيرة حقل "الملخص" وحقل "الصورة"،</li><li>تتطلب بطاقة التطبيق حقل "معرف تطبيق iPhone" وحقل "معرف تطبيق iPad" وحقل "معرف تطبيق Google Play"،</li></ul>

source: Site's Twitter account
ar: حساب تويتر للموقع

source: The @username for the website, which will be displayed in the Card's footer; must include the @ symbol.
ar: اسم المستخدم @ للموقع، والذي سيظهر في أسفل البطاقة؛ يجب أن يتضمن رمز @.

source: A description that concisely summarizes the content of the page, as appropriate for presentation within a Tweet. Do not re-use the title text as the description, or use this field to describe the general services provided by the website. The string will be truncated, by Twitter, at the word to 200 characters.
ar: وصف يُلخص المحتوى بشكل موجز للصفحة، بما يتناسب مع العرض داخل تغريدة. لا تستخدم النص العنوان كوصف، أو استخدم هذا الحقل لوصف الخدمات العامة التي يقدمها الموقع. سيتم تقصير النص بواسطة تويتر إلى 200 حرف.

source: The page's title, which should be concise; it will be truncated at 70 characters by Twitter. This field is required unless this the 'type' field is set to 'photo'.
ar: عنوان الصفحة، الذي يجب أن يكون موجزًا؛ سيتم تقصيره إلى 70 حرفًا بواسطة تويتر. هذا الحقل مطلوب ما لم يتم تعيين حقل 'النوع' إلى 'صورة'.

source: Site's Twitter account ID
ar: معرف حساب تويتر للموقع

source: The numerical Twitter account ID for the website, which will be displayed in the Card's footer.
ar: معرف حساب تويتر الرقمي للموقع، والذي سيظهر في أسفل البطاقة.

source: Creator's Twitter account
ar: حساب تويتر للمؤلف

source: The @username for the content creator / author for this page, including the @ symbol.
ar: اسم المستخدم @ للمؤلف / المؤلف المصنف لهذه الصفحة، ب

source: Creator's Twitter account ID
ar: معرف حساب تويتر للمنشئ

source: The numerical Twitter account ID for the content creator / author for this page.
ar: رابط الصورة

source: The URL to a unique image representing the content of the page. Do not use a generic image such as your website logo, author photo, or other image that spans multiple pages. Images larger than 120x120px will be resized and cropped square based on longest dimension. Images smaller than 60x60px will not be shown. If the 'type' is set to Photo then the image must be at least 280x150px.
ar: النص البديل للصورة

source: The alternative text of the image being linked to. Limited to 420 characters.
ar: النص البديل للصورة المرتبطة. محدود إلى 420 حرفًا.

source: App store country
ar: دولة متجر التطبيقات

source: If your application is not available in the US App Store, you must set this value to the two-letter country code for the App Store that contains your application.
ar: إذا لم يكن تطبيقك متاحًا في متجر التطبيقات الأمريكي، يجب عليك تعيين هذه القيمة إلى رمز الدولة المكون من حرفين للمتجر الذي يحتوي على تطبيقك.

source: iPhone app name
ar: اسم تطبيق آيفون

source: The name of the iPhone app.
ar: اسم تطبيق آيفون.

source: iPhone app's custom URL scheme
ar: نظام URL المخصص لتطبيق آيفون

source: The iPhone app's custom URL scheme (must include "://" after the scheme name).
ar: نظام URL المخصص لتطبيق آيفون (يجب أن يتضمن '://' بعد اسم النظام).

source: iPhone app ID
ar: معرف تطبيق آيفون

source: String value, should be the numeric representation of your iPhone app's ID in the App Store.
ar: قيمة سلسلة، يجب أن تكون التمثيل الرقمي لمعرف تطبيق آيفون الخاص بك في متجر التطبيقات.

source: iPad app name
ar: اسم تطبيق iPad

source: The name of the iPad app.
ar: اسم تطبيق iPad.

source: iPad app ID
ar: معرف تطبيق iPad

source: String value, should be the numeric representation of your iPad app's ID in the App Store.
ar: نظام URL المخصص لتطبيق iPad

source: The iPad app's custom URL scheme (must include "://" after the scheme name).
ar: نظام URL المخصص لتطبيق آيباد (يجب أن يتضمن '://' بعد اسم النظام).

source: Google Play app name
ar: اسم تطبيق جوجل بلاي

source: The name of the app in the Google Play app store.
ar: اسم التطبيق في متجر تطبيقات جوجل بلاي.

source: Google Play app ID
ar: معرف تطبيق جوجل بلاي

source: Your app ID in the Google Play Store (i.e. "com.android.app").
ar: معرف تطبيقك في متجر جوجل بلاي (على سبيل المثال، 'com.android.app').

source: Google Play app's custom URL scheme
ar: نظام URL المخصص لتطبيق جوجل بلاي

source: The Google Play app's custom URL scheme (must include "://" after the scheme name).
ar: نظام URL المخصص لتطبيق جوجل بلاي (يجب أن يتضمن '://' بعد اسم النظام).

source: Media player URL
ar: رابط مشغل الوسائط

source: The full URL for loading a media player, specifically an iframe for an embedded video rather than the URL to a page that contains a player. Required when using the Player Card type.
ar: type."الرابط الكامل لتحميل مشغل الوسائط، تحديدًا iframe لفيديو مدمج بدلاً من الرابط إلى صفحة تحتوي على مشغل. مطلوب عند استخدام نوع بطاقة المشغل.

source: Media player width
ar: عرض مشغل الوسائط

source: The width of the media player iframe, in pixels. Required when using the Player Card type.
ar: الطول مشغل الوسائط iframe، بالبكسل. مطلوب عند استخدام نوع

source: Media player height
ar: ارتفاع مشغل الوسائط

source: MP4 media stream URL
ar: رابط بث الوسائط MP4

source: Alternative language links (hreflang)
ar: روابط اللغة البديلة (hreflang)

source: The height of the media player iframe, in pixels. Required when using the Player Card type.
ar: ارتفاع iframe لمشغل الوسائط، بالبكسل. مطلوب عند استخدام نوع بطاقة المشغل.

source: The MIME type for the media contained in the stream URL, as defined by <a href=':url'>RFC 4337</a>.
ar: نوع MIME للوسائط الموجودة في رابط البث، كما هو معرف في <a href=':url'>RFC 4337</a>.

source: These meta tags are designed to point visitors to versions of the current page in other languages.
ar: تم تصميم هذه العلامات الميتا لتوجيه الزوار إلى إصدارات الصفحة الحالية بلغات أخرى.

source: Default locale (x-default)
ar: الإعداد المحلي الافتراضي (x-default)

source: This should point to the version of the page that is for the main or primary locale, e.g. the original version of an article that is translated into other languages.
ar: يجب أن يشير هذا إلى النسخة من الصفحة المخصصة للإعداد المحلي الرئيسي أو الأساسي، مثل النسخة الأصلية لمقالة تم ترجمتها إلى لغات أخرى.

source: URL for a version of this page in %langcode
ar: رابط النسخة من هذه الصفحة باللغة %langcode

source: Arabic
ar: العربية

source: User interface translation
ar: ترجمة واجهة المستخدمة

source: Configuration translation
ar: ترجمة التكوين

source: Configure the import of translation files, and add or customize interface translations.
ar: تكوين استيراد ملفات الترجمة، وإضافة أو تخصيص ترجمات الواجهة.

source: Translate the configuration.
ar: ترجمة التكوين.

source: Translate the interface.
ar: ترجمة الواجهة.

source: Configure global meta tag default values below. Meta tags may be left as the default.
ar: قم بتكوين القيم الافتراضية للعلامات التعريفية العامة أدناه. يمكن ترك العلامات التعريفية كما هي في الوضع الافتراضي.

source: Meta tag patterns are passed down from one level to the next unless they are overridden. To view a summary of the individual meta tags and the pattern for a specific configuration, click on its name below.
ar: يتم تمرير أنماط العلامات التعريفية من مستوى إلى آخر ما لم يتم تجاوزها. لعرض ملخص للعلامات التعريفية الفردية والنمط الخاص بتكوين معين، انقر على اسمه أدناه.

source: If the top-level configuration is not specific enough, additional default meta tag configurations can be added for a specific entity type or entity bundle, e.g. for a specific content type.
ar: إذا لم يكن التكوين على المستوى الأعلى محددًا بما فيه الكفاية، يمكن إضافة تكوينات افتراضية إضافية للعلامات التعريفية لنوع كيان أو حزمة كيان معينة، على سبيل المثال، لنوع محتوى معين.

source: Meta tags can be further refined on a per-entity basis, e.g. for individual nodes, by adding the "Metatag" field to that entity type through its normal field settings pages.
ar: يمكن تحسين العلامات التعريفية بشكل أكبر على مستوى الكيان الفردي، مثل العقد الفردية، من خلال إضافة حقل "Metatag" إلى نوع الكيان هذا عبر صفحات إعدادات الحقول المعتادة له.

source: Did you mean:
ar: هل تقصد:

source: Did you mean: @suggestion
ar: هل تقصد: @suggestion

source: @count hour
ar: ساعة

source: @count workday
ar: يوم عمل

source: Login Button
ar: دخول كموظف

source: Config pages library
ar: مكتبة إعدادات الصفحات

source: Config pages
ar: إعدادات الصفحات

source: Exposed
ar: مكشوفة

source: Exposed as tokens
ar: مكشوفة كرموز

source: Config Pages Types
ar: أنواع إعدادات الصفحات

source: Choose @name context
ar: اختيار اللغة

source: Please note that this Page is context sensitive, current context is %label
ar: يرجى ملاحظة أن هذه الصفحة حساسة للسياق، والسياق الحالي هو %label

source: Config page type
ar: أنواع إعدادات الصفحات

source: Add %type config page
ar: إضافة إعدادات الصفحات

source: Config pages settings
ar: إعدادات صفحات التكوين

source: Provide a label for this config page type to help identify it in the administration pages.
ar: قم بتوفير تسمية لنوع صفحة التكوين هذه للمساعدة في التعرف عليها في صفحات الإدارة.

source: Menu path which will be used for form display.
ar: مسار القائمة الذي سيتم استخدامه لعرض النموذج.

source: Weight of menu item.
ar: وزن عنصر القائمة.

source: Description will be displayed under link in Drupal BO.
ar: سيتم عرض الوصف تحت الرابط في Drupal BO.

source: Show context info message on ConfigPage edit form.
ar: إظهار رسالة معلومات السياق في نموذج تحرير إعدادات الصفحات.

source: Consider following context for this configuration
ar: خذ بعين الاعتبار السياق التالي لهذا التكوين

source: Fallback for contexts
ar: العودة إلى السياقات
